<template>
  <div class="loginPage">
    <div class="trademark">
      <img src="../assets/images/logo.png" class="logonImg">
      <p style="font-size:18px">咨询师入驻</p>
    </div>
    <div class="phoneBox">
      <div class="box" style="line-height: 1rem;" />
      <van-field
        id="phone"
        v-model="phone"
        placeholder="请输入手机号"
        maxlength="11"
        style="width: 80%;"
        type="tel"
        @blur="checkPhone"
      /></div>
    <div class="smsBox">
      <div class="codeBox">
        <div class="box" style="line-height: 1rem;">
          <img
            src="../assets/images/Verification_Code.png"
            style="width: 0.3rem;height: 0.4rem;margin: 0 0.2rem;"
          >
        </div>
        <van-field
          v-model="code"
          placeholder="请输入验证码"
          maxlength="4"
          type="digit"
          style="width: 80%;"
        />
      </div>
      <van-button :loading="codeLoading" :disabled="verifyShow" loading-text="获取中..." @click="getCode">
        <span v-if="!verifyShow">  获取验证码</span>
        <span v-else> {{ verifyTime }}s后重新发送</span>
      </van-button>
    </div>
    <div class="checkbox">
      <input id="awesome" v-model="check" type="checkbox" disabled>
      <label for="awesome" style="font-size:.26rem;"> 我已同意<label for="awesome" style="font-size:.26rem;color:#80cf94; " @click="setInShowPopup">《入驻协议》</label><label for="awesome" style="font-size:.26rem;color:#80cf94; " @click="showPopup">《隐私协议》</label></label></div>
    <van-popup
      v-model="show"
      style="height:70%;width:80%;"
      round
    >
      <div  class="privacy" style="padding: 15px 15px; margin:15px 0 0 0;">
        <p style="text-align: center;"><strong>隐私协议</strong></p>
        <p>&nbsp;</p>
        <p>本应用尊重并保护所有使用服务用户的个人隐私权。为了给您提供更准确、更有个性化的服务，本应用会按照本隐私权政策的规定使用和披露您的个人信息。但本应用将以高度的勤勉、审慎义务对待这些信息。除本隐私权政策另有规定外，在未征得您事先许可的情况下，本应用不会将这些信息对外披露或向第三方提供。本应用会不时更新本隐私权政策。 您在同意本应用服务使用协议之时，即视为您已经同意本隐私权政策全部内容。本隐私权政策属于本应用服务使用协议不可分割的一部分。</p>
        <ol>
          <li>适用范围</li>
        </ol>
        <p>(a) 在您注册本应用帐号时，您根据本应用要求提供的个人注册信息；</p>
        <p>(b) 在您使用本应用网络服务，或访问本应用平台网页时，本应用自动接收并记录的您手机和计算机上的信息，包括但不限于您的浏览器的类型、使用语言、访问日期和时间、软硬件特征信息及您需求的网页记录等数据；</p>
        <p>(c) 本应用通过合法途径从商业伙伴处取得的用户个人数据。</p>
        <p>您了解并同意，以下信息不适用本隐私权政策：</p>
        <p>(a) 您在使用本应用平台提供的搜索服务时输入的关键字信息；</p>
        <p>(b) 本应用收集到的您在本应用发布的有关信息数据，包括但不限于参与活动、成交信息及评价详情；</p>
        <p>(c) 违反法律规定或违反本应用规则行为及本应用已对您采取的措施。</p>
        <ol start="2">
          <li>信息使用</li>
        </ol>
        <p>(a)本应用不会向任何无关第三方提供、出售、出租、分享或交易您的个人信息，除非事先得到您的许可，或该第三方和本应用（含本应用关联公司）单独或共同为您提供服务，且在该服务结束后，其将被禁止访问包括其以前能够访问的所有这些资料。</p>
        <p>(b) 本应用亦不允许任何第三方以任何手段收集、编辑、出售或者无偿传播您的个人信息。任何本应用平台用户如从事上述活动，一经发现，本应用有权立即终止与该用户的服务协议。</p>
        <p>(c) 为服务用户的目的，本应用可能通过使用您的个人信息，向您提供您感兴趣的信息，包括但不限于向您发出产品和服务信息，或者与本应用合作伙伴共享信息以便他们向您发送有关其产品和服务的信息（后者需要您的事先同意）。</p>
        <ol start="3">
          <li>信息披露</li>
        </ol>
        <p>在如下情况下，本应用将依据您的个人意愿或法律的规定全部或部分的披露您的个人信息：</p>
        <p>(a) 经您事先同意，向第三方披露；</p>
        <p>(b)为提供您所要求的产品和服务，而必须和第三方分享您的个人信息；</p>
        <p>(c) 根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；</p>
        <p>(d) 如您出现违反中国有关法律、法规或者本应用服务协议或相关规则的情况，需要向第三方披露；</p>
        <p>(e) 如您是适格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷；</p>
        <p>(f) 在本应用平台上创建的某一交易中，如交易任何一方履行或部分履行了交易义务并提出信息披露请求的，本应用有权决定向该用户提供其交易对方的联络方式等必要信息，以促成交易的完成或纠纷的解决。</p>
        <p>(g) 其它本应用根据法律、法规或者网站政策认为合适的披露。</p>
        <ol start="4">
          <li>信息存储和交换</li>
        </ol>
        <p>本应用收集的有关您的信息和资料将保存在本应用及（或）其关联公司的服务器上，这些信息和资料可能传送至您所在国家、地区或本应用收集信息和资料所在地的境外并在境外被访问、存储和展示。</p>
        <ol start="5">
          <li>数据缓存的使用</li>
        </ol>
        <p>(a) 在您未拒绝接受缓存的情况下，本应用会在您的手机上设定或取用缓存 ，以便您能登录或使用依赖于缓存的本应用平台服务或功能。本应用使用缓存可为您提供更加周到的个性化服务，包括推广服务。</p>
        <p>(b) 通过本应用所设缓存所取得的有关信息，将适用本政策。</p>
        <ol start="6">
          <li>信息安全</li>
        </ol>
        <p>(a) 本应用帐号均有安全保护功能，请妥善保管您的用户名及验证码信息。本应用将通过对用户验证码进行加密等安全措施确保您的信息不丢失，不被滥用和变造。尽管有前述安全措施，但同时也请您注意在信息网络上不存在&ldquo;完善的安全措施&rdquo;。</p>
        <p>7.本隐私政策的更改</p>
        <p>(a)如果决定更改隐私政策，我们会在本政策中、本公司网站中以及我们认为适当的位置发布这些更改，以便您了解我们如何收集、使用您的个人信息，哪些人可以访问这些信息，以及在什么情况下我们会透露这些信息。</p>
        <p>(b)本公司保留随时修改本政策的权利，因此请经常查看。如对本政策作出重大更改，本公司会通过网站通知的形式告知。</p>
        <p>为防止向第三方披露自己的个人信息，如联络方式或者邮政地址。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息泄密，尤其是本应用用户名及密码发生泄露，请您立即联络本应用客服，以便本应用采取相应措施。</p>
        <p style="text-align: right;">本协议于2020年3月4日发布并执行。</p>
        <p>&nbsp;</p>
      </div>
    </van-popup>
    
    <van-popup
      v-model="setInShow"
      style="height:70%;width:80%;"
      round
      >
      <div class="set-in" style="padding: 15px 15px; margin:15px 0 0 0;">
        <p style="text-align: center;"><strong>咨询师入驻协议</strong></p>
        <p>一、提示条款</p>
        <p>在接受本协议之前，应当认真阅读本协议。请咨询师务必审慎阅读、充分理解各条款内容，特别是免除或限制责任的条款、法律适用、和争议解决条款。免除或限制责任的条款将以粗体下划线标识，应重点阅读。如咨询师对协议有任何疑问，请不要进行后续操作，及时可联系泡泡心理。</p>
        <p>心理咨询预约平台：指泡泡心理的PC网站、手机网站和APP平台的合称。</p>
        <p>心理咨询师：指同意并承诺遵守本协议规定使用泡泡心理的心理咨询预约平台向泡泡心理平台用户提供心理咨询服务的拥有相应资质的咨询师。 心理咨询预约服务：指心理咨询师通过本协议服务平台发布咨询信息，向服务平台用户提供心理咨询和科学心理学传播等。</p>
        <p>二、定义</p>
        <p>泡泡心理：指江苏曼珠沙华心理信息咨询有限公司所运营的泡泡心理网站、APP网站。</p>
        <p>咨询师：指同意并承诺遵守本协议规定向网站用户提供心理咨询服务的拥有相应资质的咨询师。</p>
        <p>心理咨询预约网站：指泡泡心理的PC网站、手机网站和APP的合称。</p>
        <p>心理咨询预约服务：指咨询师通过本协议网站发布咨询信息，向网站用户提供心理咨询和科学心理学传播等。</p>
        <p>心理咨询：指咨询师与用户双方通过面谈、网络视频、语音和图文为媒介，共同探讨引起心理问题的原因，分析问题症结，进而帮助用户寻求摆脱困境解决问题的条件和对策，以便恢复心理平衡、提高对环境的适应能力，增进身心健康。</p>
        <p>三、协议生效和适用范围</p>
        <p>（一）咨询师通过网络页面点击确认或以其他方式选择接受本协议，表示咨询师同意接受本协议的全部内容。</p>
        <p>（二）咨询师签署或在线接受本协议并不导致本协议立即生效，经过泡泡心理审核通过并向咨询师发出服务开通通知，咨询师首次登录时本协议成立，并在咨询师和泡泡心理之间产生法律效力。</p>
        <p>四、入驻方式</p>
        <p>（一）咨询师同意并确认其可以通过直接入驻泡泡心理网站的方式为用户提供咨询服务，也可以是通过入驻到其他网站、机构、工作室等第三方的方式为泡泡心理网站上的用户提供心理咨询服务。</p>
        <p>（二）咨询师同意并确认泡泡心理有权将对咨询师的管理授权给第三方执行。</p>
        <p>五、协议内容</p>
        <p>（一）本协议内容包括协议正文以及所有本网站已经发布的或将来可能发布的各类规则、通知、公告等。所有规则为协议不可分割的组成部分，与协议正文具有同等法律效力。泡泡心理将就网站制定特别规则（下称"特别规则"），如特别规则与网站其他规则存在冲突，则以特别规则为准。</p>
        <p>（二）咨询师在使用本网站提供的各项服务的同时，承诺接受并遵守各项相关规则的规定。泡泡心理有权根据需要不时地制定、修改本协议或各类规则，如有任何变更，泡泡心理将在网站、APP等以公示的方式进行公告，不再单独通知每个咨询师。变更后的协议和规则一经公布即自动生效，成为本协议的一部分。如咨询师不同意相关变更，应当立即以书面通知的方式终止本协议；任何修订和新规则一经在网站上公布即自动生效，成为本协议的一部分。如咨询师登录或继续使用服务的，则视为对修改后的协议和规则不持异议并同意遵守。除另行明确声明外，任何使服务范围扩大或功能增强的新内容均受本协议约束。</p>
        <p>（三）泡泡心理保留在任何时候自行决定对服务及其相关功能、应用软件变更、升级的权利。泡泡心理进一步保留在服务中开发新的模块、功能和软件或其它语种服务的权利。上述所有新的模块、功能、软件服务的提供，除非泡泡心理另有说明，否则仍适用本协议。服务随时可能因泡泡心理的单方判断而被增加或修改，或因定期、不定期的维护而暂缓提供，咨询师将会得到相应的变更通知。咨询师在此同意泡泡心理在任何情况下都无需向其或第三方在使用服务时对其在传输或联络中的迟延、不准确、错误或疏漏及因此而致使的损害负责。</p>
        <p>六、入驻资格</p>
        <p>(一) 咨询师确认，在完成注册程序或以泡泡心理网站允许的方式实际使用服务或产品时，您应当具备至少以下资格：</p>
        <p>1、咨询师是具备完全民事权利能力和所从事的民事行为相适应的自然人。</p>
        <p>2、咨询师欲使用本协议下服务，必须向泡泡心理提交其申请服务时提供信息的相关证明。具体证明信息内容包括</p>
        <p>　1)&nbsp;个人手持咨询师本人身份证明（身份证/护照）照；</p>
        <p>　2)&nbsp;专科及以上有效学历证书；</p>
        <p>　3)&nbsp;个人手持国家人力资源与社会保障部颁发的咨询师职业资格证书照；</p>
        <p>　4)&nbsp;中国心理学会临床与咨询心理学专业委员会注册临床与咨询心理师、临床与咨询督导师证明；</p>
        <p>　5)&nbsp;其他海外国家认证咨询师，督导师证明；</p>
        <p>　6)&nbsp;个案时长证明（督导或者现就职/曾就职机构开具）；</p>
        <p>　7)&nbsp;培训证明；</p>
        <p>　8)&nbsp;本人形象照；</p>
        <p>　9)&nbsp;联系方式（电话，邮箱）；</p>
        <p>　10) 真实姓名；</p>
        <p>　11)&nbsp;其他泡泡心理认为需查验的信息。</p>
        <p>咨询师注册应同意：确保提供真实、正确、最新及完整的资料。若提供任何错误、不实、过时或不完整或具误导性的资料，或者本网站有理由怀疑前述资料为错误、不实、过时或不完整或具误导性的，本网站有权终止您的帐号，并拒绝您于现在和未来使用本网站所提供服务之全部或任何部分，并有权要求咨询师赔偿由此造成的损失。</p>
        <p>(二) 若咨询师不具备前述主体资格，则咨询师应承担由此产生的一切后果，且泡泡心理有权终止咨询师的咨询账号，由此造成的损失，泡泡心理有权向咨询师索赔。</p>
        <p>(三) 协议期内，上述资格信息或相关证明文件发生任何变更，咨询师应及时书面通知泡泡心理，如上述资格信息或相关证明文件使得咨询师不再具备履行本协议的情形出现时，泡泡心理有权立即终止或中止本协议。 咨询师同意为未及时的通知或更新其信息承担全部责任，咨询师保证其以任何形式向泡泡心理提供的全部证明文件真实、准确且不存在超过时效问题（即保证所有证明文件在整个合同履行期间都处于有效期内）如因上述原因发生纠纷或被相关国家主管机关处罚，咨询师应当独立承担全部责任，如给泡泡心理（包括其合作伙伴、代理人、职员等）造成损失的，咨询师同意赔偿其全部损失。</p>
        <p>七、账户说明</p>
        <p>(一) 当您按照本网站的流程完成全部注册程序并签署本协议后，泡泡心理会向咨询师提供唯一编号的咨询账户。咨询师应对自己的咨询账户和验证码的安全负责。除非有法律规定或司法裁定，且征得泡泡心理的同意，否则，账户不得以任何方式转让、赠与或继承。如果发现任何人不当使用咨询师账户或有任何其他可能危及咨询师账户安全的情形时，咨询师应当立即以有效方式通知泡泡心理，要求泡泡心理暂停相关服务。咨询师向泡泡心理提供所需注册资料、阅读并同意本协议、完成全部注册程序后，即成为泡泡心理注册咨询师。在后续的使用过程中，咨询师应当及时更新自己的资料，以使之真实、及时，完整和准确。</p>
        <p>(二) 泡泡心理网站只允许每位咨询师使用一个账户。如有证据证明或本网站有理由相信咨询师存在不当注册或不当使用多个账户的情形，本网站可采取注销账户并拒绝提供服务措施，如给本网站及其相关方造成损失的，咨询师还应承担赔偿责任。</p>
        <p>八、入驻规则</p>
        <p>（一）合法性</p>
        <p>咨询师在使用本网站服务时，务必遵守中华人民共和国相关法律法规及本网站的各项规则和要求，不违背社会公共利益或公共道德，不损害他人的合法权益，不违反本协议及相关规则，不得把本网站提供的服务用于任何违法或不正当或不道德的活动，包括但不限于以下行为：</p>
        <p>1.违反宪法或法律法规规定的；危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；损害国家荣誉和利益的，损害公共利益的；煽动民族仇恨、民族歧视，破坏民族团结的；破坏国家宗教政策，宣扬邪教和封建迷信的；散布谣言，扰乱社会秩序，破坏社会稳定的；散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；侮辱或者诽谤他人，侵害他人合法权益的；含有法律、行政法规禁止的其他内容的</p>
        <p>2.以虚构或歪曲事实的方式不当评价其他泡泡心理的咨询师，采取不正当方式制造或提高自身的评价度及信用度，采取不正当方式制造或提高（降低）其他咨询师的评价度及信用度。</p>
        <p>3.以任何非法目的而使用网络服务系统</p>
        <p>4.其他危害计算机信息网络安全的行为。</p>
        <p>（二）排名颁奖</p>
        <p>咨询师同意：泡泡心理可以根据心理咨询预约PC网站、手机网站及APP所开展的业务，对咨询师回答问题质量的评价以及其他专业、学术指标将咨询师与其他咨询师进行排名。</p>
        <p>咨询师同意：泡泡心理可以设定颁奖活动规则，对排名靠前的咨询师进行颁奖。咨询师亦同意遵守网站的颁奖活动规则和奖项设置规则，理解并接受不是每一个咨询师都符合获奖资格。</p>
        <p>(三) 禁止私自交易</p>
        <p>咨询师不得与用户私下交易。私下交易包括但不限于：咨询师与用户通过网站互相认识/曾经发生过交易，但是，双方之后约定不通过泡泡心理网站支付/收取咨询费，由咨询师直接收取用户咨询费/咨询师指定其它第三方机构收取用户咨询费而产生的咨询服务交易。</p>
        <p>咨询师同意私自交易属于严重违规情形，泡泡心理网站如有证据证明或本网站有理由相信咨询师存在私下交易的情形，本网站有权直接注销该咨询师的账户，如给本网站及其相关方造成损失的，咨询师还应承担赔偿责任。</p>
        <p>若咨询师与用户私下交易并发生纠纷的，请自行解决双方纠纷，与泡泡心理网站无关，泡泡心理没有收取咨询费亦无协助解决的义务。</p>
        <p>九、提供服务</p>
        <p>（一）咨询师在从事心理咨询时，应遵守职业道德，遵守国家有关的法律法规，在咨询工作中建立并执行严格的道德准则。</p>
        <p>（二）咨询师应遵从泡泡心理的安排，本着负责的态度尽心尽力向泡泡心理指定的用户提供优质的咨询服务，遵守预约时间，如有特殊情况提前告知用户。</p>
        <p>（三）咨询师在从事咨询服务过程中，不得利用用户对自己的信任和依赖谋取私权，不得与用户私下交易。</p>
        <p>（四）咨询师在泡泡心理网站上仅从事心理咨询活动，不得行使处方权，不得对用户进行心理治疗或精神障碍的诊断、治疗等。如发现接受咨询的用户可能患有精神障碍的，应当建议到符合规定的医疗机构就诊。</p>
        <p>（五）在咨询过程中，用户因自身原因而突发疾病或意外死亡，或因自身原因造成情绪失控而发生自伤、自残、自杀等后果，咨询师尽可能采取措施控制事态恶化，必要时与相关部门取得联系。</p>
        <p>十、更改预约</p>
        <p>（一）咨询师需要更改预约（包括咨询时间、咨询方式、取消咨询等），需要在预约开始前至少24小时提出。如：原定周三晚上18：00开始的咨询，请在周二晚18：00之前提出更改。</p>
        <p>（二）如咨询师在可更改时间后提出更改预约，则咨询师应为用户提供一次50分钟的免费咨询。</p>
        <p>十一、咨询服务完成</p>
        <p>（一）用户订单在该笔订单预约的时间段结束后，订单完成。</p>
        <p>（二）督导订单在督导师点击&ldquo;督导完毕&rdquo;后，订单完成。</p>
        <p>十二、费用</p>
        <p>（一）泡泡心理应向咨询师支付其应得的咨询费。</p>
        <p>（二）关于退费：</p>
        <p>用户在线上预约咨询师后，咨询师拒绝用户的预约或在接受预约后，未进行咨询服务前取消咨询，或在提供咨询服务过程中咨询师（或用户）拒绝进行服务的，均由咨询师向泡泡心理发起取消订单申请。咨询师同意并确认在发起取消订单后24小时内将应返还用户的款项金额一次性返还至泡泡心理账户，泡泡心理收到款项后无息原路返还给用户。</p>
        <p>十三、隐私保护</p>
        <p>（一）网站将采取合理的安全手段保护您已存储的个人信息，除下述信息披露条款外，在未得到您许可之前，网站不会将您的任何个人信息提供给任何无关的第三方（包括公司个人）。</p>
        <p>1.经您事先同意，向第三方披露；</p>
        <p>2.只有通过使用用户的保密信息，才能向用户提供所要求的产品服务；</p>
        <p>3.根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；</p>
        <p>4.如您出现违反中国有关法律、法规或者网站法律声明、服务协议或相关规则的情况，需要向第三方披露；</p>
        <p>5.维护网站的合法权益；</p>
        <p>6.根据本协议相关规定或者网站认为必要的其他情况。</p>
        <p>（二）网站亦不允许任何第三方以任何手段收集、编辑、出售或者无偿传播您的个人信息。</p>
        <p>十四、权利声明</p>
        <p>（一）泡泡心理所属公司拥有本网站内的所有产品、技术、程序、资料、信息内容（包括但不限于文字、图片、图像、照片、音频、视频、图表、色彩、版面设计、电子文档）的所有权利（包括但不限于版权、商标权、专利权、商业秘密及其他所有相关权利）。未经权利人许可，任何人不得擅自使用。</p>
        <p>（二）咨询师接受本协议即视为您主动将您在本网站发表的任何形式的信息的著作权，包括但不限于复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及《著作权法》规定的由著作权人享有的其他著作财产权利无偿独家转让给本网站所有，若发生第三人侵权，本网站有权单独提起诉讼并获得全部赔偿。泡泡心理平台可以对已入驻咨询师在网络上所发表的文章类信息，进行展示供用户浏览。</p>
        <p>（三）咨询师同意本网站后服务市场的全部运营数据，包括但不限于用户信息、用户列表、用户关系、用户的使用数据、交易数据、订单数据等，其全部的权利均归属于本网站。未经本网站事先书面同意，服务商均不得利用用户列表及用户关系、向用户发送信息，不得为任何目的擅自保存、备份、泄露、使用或授权他人使用前述运营数据。本协议自然终止或提前解除后，咨询师无权要求备份前述运营数据。</p>
        <p>（四）咨询师通过注册所得的本网站账户（即本网站用户ID）所有权归属于本网站公司，咨询师仅对该账户拥有使用权。如您以任何方式转让的，本网站有权追究您的违约责任，由此产生的一切责任由您自行承担。</p>
        <p>（五）对不遵守本协议或其他违法、未经许可或者恶意使用本网站内容者，本网站所属公司保留追究其法律责任的权利。</p>
        <p>十五、第三人主张权利</p>
        <p>因网站的特殊性，泡泡心理没有义务对所有咨询师的服务行为以及与服务有关的其它事项进行事先审查，但如存在下列情况：</p>
        <p>1.第三方通知泡泡心理，认为某个具体咨询师或具体服务事项可能存在重大问题。</p>
        <p>2.咨询师或第三方向泡泡心理告知网站上有违法或不当行为的； 泡泡心理以普通非专业人员的知识水平标准对相关内容进行判别，可以认为这些内容或行为具有违法或不当性质的，泡泡心理有权根据不同情况选择删除相关信息或停止对该咨询师提供网站，并追究相关法律责任。</p>
        <p>十六、反贿赂</p>
        <p>咨询师不得向泡泡心理及其关联企业之员工、顾问提供任何形式的不正当利益。如有，无论后是否实际获得利益，本网站均有权立即解除本合同，并由咨询师按提供任何形式的不正当利益的总金额向本网站赔偿。</p>
        <p>十七、保密</p>
        <p>（一）咨询师保证在使用本网站过程中所获悉的属于本网站及他方的且无法自公开渠道获得的商业秘密、专有信息、双方共有的客户信息及其他保密性质的所有信息均为保密信息（包括但不限于商业秘密、公司计划、运营活动、财务信息、技术信息、经营信息及其他商业秘密）。未经该信息的原享有方同意，不应以任何形式向第三方披露或泄露保密信息，否则，应承担赔偿损失责任。</p>
        <p>（二）不论本服务协议是否变更、解除或终止，本条款均由法律效力。</p>
        <p>十八、免费及有限责任</p>
        <p>（一）泡泡心理不保证网络服务的及时性、安全性、准确性。不论在何种情况下，均不对由于Internet连接故障，电脑，通讯或其他系统的故障，电力故障，罢工，劳动争议，暴乱，起义，骚乱，生产力或生产资料不足，火灾，洪水，风暴，爆炸，不可抗力，战争，政府行为，国际、国内法院的命令或第三方的不作为而造成的不能服务或延迟服务承担责任。请咨询师务必及时保存自己的需求，否则因网络服务中断，需要维修、检修、维护等导致损失的，本网站不承担损失赔偿的责任。</p>
        <p>（二）在任何情况下，对于因使用泡泡心理网站内容或无法进入本网站而导致的任何直接的、间接的、附带的、给第三人造成的损失（包括但不限于利润损失、信息数据丢失、财产毁坏等损失），泡泡心理均无须承担法律责任，不论是采用合同之诉、侵权之诉或其他诉讼理由。</p>
        <p>（三）未经授权的存取或修改数据或数据的传输，本网站不承担赔偿因此造成损失的责任。</p>
        <p>（四）第三方通过服务所作的陈述或行为，本网站不承担赔偿因此造成损失的责任。</p>
        <p>（五）其他与服务相关事件，包括疏忽等所造成的损害，本网站不承担赔偿因此造成损失的责任。</p>
        <p>十九、违约责任</p>
        <p>（一）如咨询师在约定好的咨询时间内迟到，应补齐原定咨询时间，并退还迟到时段所对应的咨询费用。</p>
        <p>（二）咨询师同意赔偿由于使用服务（包括但不限于将咨询师资料展示在网站上）或违反本协议而给泡泡心理造成的任何损失（包括但不限于诉讼费、律师费、公证费、差旅费等）。咨询师同意泡泡心理不对任何其张贴的资料，包括诽谤性的，攻击性的或非法的资料，承担任何责任；由于此类材料对其它用户造成的损失由咨询师自行全部承担。</p>
        <p>（三）除本协议及网站规则另有约定之外，如一方发生违约行为，守约方可以书面通知方式要求违约方在指定的时限内停止违约行为，并就违约行为造成的损失进行索赔，如违约方未能按时停止违约行为，则守约方有权立即终止本协议。</p>
        <p>（四）如咨询师的行为使泡泡心理及所属公司遭受第三人主张权利，泡泡心理及所属公司可在对第三人承担金钱给付义务后就全部损失向您追偿。</p>
        <p>（五）泡泡心理因违约或侵权依法对咨询师赔偿损失的，赔偿额以泡泡心理就该咨询师最终实际收取用户的费用总额为限。</p>
        <p>二十、协议终止</p>
        <p>（一）通知解除：协议任何一方均可以提前三天通知终止本协议。</p>
        <p>（二）泡泡心理单方解除权：</p>
        <p>1.如咨询师违反泡泡心理网的任何规则或本协议中的任何承诺或保证，包括但不限于本协议项下的任何约定，泡泡心理都有权立刻终止本协议，注销咨询师的账号，因注销账号造成咨询师损失的，由咨询师自行承担，网站不承担赔偿损失责任。</p>
        <p>2.若咨询师屡次违反本协议或相关规定，经泡泡心理提醒仍不改正的；或因咨询师的言行对泡泡心理造成人民币1000元以上损失的，泡泡心理有权终止与咨询师的协议，注销咨询师的账号，因注销账号造成咨询师损失的，由咨询师自行承担，网站不承担赔偿损失责任。</p>
        <p>（三）若双方无法达成一致，泡泡心理无权强制咨询师使用心理咨询网站。咨询师可根据自己意愿，随时、随地终止心理咨询网站的使用。咨询师完全终止心理咨询网站使用后一年或咨询师通过电子邮件形式告知泡泡心理，本协议将自动终止。在协议终止前、账号注销前，咨询师均可随时、随地自行再次开通心理咨询网站的使用。本协议终止后咨询师的泡泡心理咨询账号将被自动注销，之后泡泡心理无权使用、展示您的肖像、资料等信息。</p>
        <p>（四）本协议规定的其他协议终止条件发生或实现，导致本协议终止。</p>
        <p>（五）协议终止后有关事项的处理：</p>
        <p>1.协议终止后，泡泡心理没有义务为咨询师保留账户中或与之相关的任何信息，或转发任何未曾阅读或发送的信息给咨询师或第三方。亦不就终止协议而对咨询师或任何第三者承担任何责任。</p>
        <p>2.无论本协议因何原因终止，在协议终止前的行为所导致的任何赔偿和责任，咨询师必须完全且独立地承担。</p>
        <p>3.协议终止后，泡泡心理有权保留该咨询师的注册数据及以前的服务行为记录。如咨询师在协议终止前在网站上存在违法行为或违反协议的行为，泡泡心理仍可行使本协议所规定的权利。</p>
        <p>二十一、协议期限</p>
        <p>本协议经咨询师在线接受且经过泡泡心理审核通过后（或书面签署后）即告生效，除非本协议规定的终止条件发生，本协议将持续有效。双方另有约定的除外。</p>
        <p>二十二、有效通知</p>
        <p>（一）咨询师应当准确填写并及时更新提供给泡泡心理的电子邮件地址、联系电话、联系地址、邮政编码等联系方式，保证联系方式的有效性及安全性，以便泡泡心理及其他用户可以通过上述联系方式与自己进行有效联系。如因通过上述联系方式无法与咨询师取得联系，导致本网站产生任何损失或增加费用的，应由咨询师完全独立承担。</p>
        <p>（二）本协议下所规定的通知有权要求以书面形式通过以下邮址递交收悉，通知的到达以泡泡心理收悉为准。<br />泡泡心理地址：苏州工业园区和众街58号星汇生活广场3幢526室；邮编：215000 ； 收件人：泡泡心理咨询组 （收）</p>
        <p>二十三、争议解决</p>
        <p>（一）本协议之解释与适用，以及与本协议有关的争议，均应依照中华人民共和国法律予以处理，并以苏州工业园区人民法院为管辖法院。</p>
        <p>（二）如本协议的任何条款被视作无效或无法执行，则上述条款可被分离，其余部份则仍具有法律效力。</p>
        <p>（三）泡泡心理于咨询师过失或违约时放弃本协议规定的权利的，不得视为其对咨询师的其他或以后同类之过失或违约行为弃权。</p>
        <p style="text-align: right;">本协议于2020年3月4日发布并执行。</p>
      </div>
    </van-popup>
    <van-button class="footer" :loading="loading" loading-text="登入中..." @click="login">登入</van-button>
  </div>
</template>>

<script>
import { settledInLogin, settledInLoginGetCode } from '@/api/consultant'
import { setToken } from '@/utils/token'
import { Popup } from 'vant'
export default {
  name: 'LoginPage',
  components: {
    [Popup.name]: Popup
  },
  data() {
    return {
      popBox: false,
      phone: '',
      check: true,
      code: '',
      codeLoading: false,
      loading: false,
      verifyTime: '',
      verifyShow: false,
      show: false,
      setInShow: false
    }
  },
  methods: {
    checkPhone() {
      var phone = this.phone
      if (!/^1[3456789]\d{9}$/.test(phone)) {
        this.$notify('请输入正确的手机号')
        this.phone = ''
        return false
      }
      return true
    },
    closeBox() {
      this.popBox = false
    },
    login() {
      if (this.code === '' || this.code.length !== 4) {
        this.$notify('请输入4位验证码')
        return
      }
      if (this.checkPhone()) {
        this.loading = true
        settledInLogin(this.phone, this.code).then(r => {
          this.loading = false
          if (!r.success) {
            this.$notify(r.message)
          } else {
            setToken(r.result.token)
            localStorage.setItem('USER_ID', r.result.userId)
            localStorage.setItem('CONSULTANT_ID', r.result.consultantId)
            localStorage.setItem('CONSULTANT_STATUS', r.result.consultantStatus)
            localStorage.setItem('CONSULTANT_REMARK', r.result.consultantRemark)
            if (!r.result.consultantStatus) {
              localStorage.setItem('STEP', 1)
            } else {
              localStorage.setItem('STEP', 5)
            }
            this.$router.push({ name: 'consulant' })
          }
          console.log(r)
        })
      }
    },
    getCode() {
      if (this.checkPhone()) {
        this.codeLoading = true
        const _this = this
        settledInLoginGetCode(this.phone).then(r => {
          this.codeLoading = false
          if (r.success) {
            this.$dialog.alert({
              message: '验证码获取成功'
            })
            this.verifyTime = 60
            _this.verifyShow = true
            _this.timeInterval = setInterval(() => {
              if (_this.verifyTime > 0) {
                _this.verifyTime--
              } else {
                _this.verifyShow = false
                window.clearInterval(_this.timeInterval)
              }
            }, 1000)
          } else {
            this.$dialog.alert({
              message: r.message
            })
          }
          // 跳转一下一个界面
        })
        return
      }
    },
    showPopup() {
      this.show = true
    },
    setInShowPopup() {
      this.setInShow = true
    }
  }
}
</script>>

<style scoped>
.privacy p {
   font-size: 14px;
}
.privacy li {
   font-size: 14px;
}
.set-in p {
   font-size: 14px;
}
.loginPage {
  width: 100%;
  height: 100%;
  background-image: url('../assets/images/background.png');
  background-size: 100% 100%;
}

.trademark {
  margin: 0 auto;
  width: 2rem;
  height: 3rem;
  padding-top: 3rem;
  padding-bottom: 1rem;
  text-align: center;
  font-size: 0.32rem;
  font-weight: 600;
  color: #80cf94;
  line-height: 0.8rem;
}

.logonImg {
  width: 2rem;
  height: 2rem;
  /* border: .02rem solid #9ddcb0; */
  box-shadow: 0rem 0rem 0.27rem #9ddcb0;
  border-radius: 0.4rem;
}

.phoneBox {
  width: 90%;
  margin: 0 auto;
  border: 0.02rem solid #f0f0f0;
  box-shadow: 0rem 0rem 0.27rem #9ddcb0;
  border-radius: 0.1rem;
  display: flex;
  flex-direction: row;
  align-items: center;
  margin-bottom: 0.3rem;
}

.phoneImg {
  width: 0.3rem;
  height: 0.46rem;
  margin: 0 0.2rem;
}

.smsBox {
  width: 90%;
  margin: 0 auto;
  display: flex;
  justify-content: space-between;
  align-items: center;
  margin-bottom: 3rem;
}

.codeBox {
  width: 60%;
  border: 0.02rem solid #9ddcb0;
  box-shadow: 0rem 0rem 0.27rem #9ddcb0;
  border-radius: 0.1rem;
  display: flex;
  flex-direction: row;
  align-items: center;
}

.van-button {
  background: #9ddcb0;
  border: 0.02rem solid #9ddcb0;
  color: #ffffff;
}
.checkbox {
  display: flex;
  justify-content: center;
  margin-bottom: 0.2rem;
}

input[type='checkbox'] + label::before {
  content: '\a0';
  /*不换行空格*/
  display: inline-block;
  width: 0.26rem;
  height: 0.26rem;
  border: 0.02rem solid rgba(157, 220, 177);
  border-radius: 0.05rem;
  background-color: #ffffff;
  line-height: 0.26rem;
  margin-right: 0.08rem;
  /*行高不加单位，子元素将继承数字乘以自身字体尺寸而非父元素行高*/
}

input[type='checkbox']:checked + label::before {
  content: '\2713';
  background-color: #ffffff;
  text-align: center;
  color: #80cf94;
  font-size: 0.22rem;
}

.checkbox input {
  position: absolute;
  clip: rect(0, 0, 0, 0);
}

input[type='checkbox']:disabled + label::before {
  background-color: #ffffff;
  box-shadow: none;
  color: #555;
}
.footer {
  text-align: center;
  color: #ffffff;
  width: 6.9rem;
  height: 0.8rem;
  line-height: 0.8rem;
  font-size: 0.26rem;
  margin: 0.3rem;
  background-color: #9ddcb0;
  border-radius: 0.14rem;
  margin-bottom: 0.4rem;
}
p{
  font-size: 0.14rem;
  padding: 0.02rem;
}
</style>
