<template>
  <div class="loginPage">
    <div class="trademark">
      <img src="../assets/images/register.png" class="logonImg">
      <p>泡泡心理</p>
    </div>
    <div class="phoneBox">
      <div class="box" style="line-height: 1rem;" />
      <van-field
        id="phone"
        v-model="phone"
        placeholder="请输入手机号"
        maxlength="11"
        style="width: 80%;"
        type="tel"
        @blur="checkPhone"
      /></div>
    <div class="smsBox">
      <div class="codeBox">
        <div class="box" style="line-height: 1rem;">
          <img
            src="../assets/images/Verification_Code.png"
            style="width: 0.3rem;height: 0.4rem;margin: 0 0.2rem;"
          >
        </div>
        <van-field
          v-model="code"
          placeholder="请输入验证码"
          maxlength="4"
          type="digit"
          style="width: 80%;"
        />
      </div>
      <van-button :loading="codeLoading" :disabled="verifyShow" loading-text="获取中..." @click="getCode">
        <span v-if="!verifyShow">  获取验证码</span>
        <span v-else> {{ verifyTime }}s后重新发送</span>
      </van-button>
    </div>
    <div class="checkbox">
      <input id="awesome" v-model="check" type="checkbox" disabled>
      <label for="awesome" style="font-size:.26rem;"> 我已同意<label for="awesome" style="font-size:.26rem;color:#80cf94; " @click="setInShowPopup">《注册协议》</label><label for="awesome" style="font-size:.26rem;color:#80cf94; " @click="showPopup">《隐私协议》</label></label></div>
    <van-popup
      v-model="show"
      style="height:70%;width:80%;"
      round
    >
      <div style="padding: 15px 15px; margin:30px 0 0 0;">
        <p style="text-align: center;"><strong>隐私协议</strong></p>
        <p>&nbsp;</p>
        <p>本应用尊重并保护所有使用服务用户的个人隐私权。为了给您提供更准确、更有个性化的服务，本应用会按照本隐私权政策的规定使用和披露您的个人信息。但本应用将以高度的勤勉、审慎义务对待这些信息。除本隐私权政策另有规定外，在未征得您事先许可的情况下，本应用不会将这些信息对外披露或向第三方提供。本应用会不时更新本隐私权政策。 您在同意本应用服务使用协议之时，即视为您已经同意本隐私权政策全部内容。本隐私权政策属于本应用服务使用协议不可分割的一部分。</p>
        <ol>
          <li>适用范围</li>
        </ol>
        <p>(a) 在您注册本应用帐号时，您根据本应用要求提供的个人注册信息；</p>
        <p>(b) 在您使用本应用网络服务，或访问本应用平台网页时，本应用自动接收并记录的您手机和计算机上的信息，包括但不限于您的浏览器的类型、使用语言、访问日期和时间、软硬件特征信息及您需求的网页记录等数据；</p>
        <p>(c) 本应用通过合法途径从商业伙伴处取得的用户个人数据。</p>
        <p>您了解并同意，以下信息不适用本隐私权政策：</p>
        <p>(a) 您在使用本应用平台提供的搜索服务时输入的关键字信息；</p>
        <p>(b) 本应用收集到的您在本应用发布的有关信息数据，包括但不限于参与活动、成交信息及评价详情；</p>
        <p>(c) 违反法律规定或违反本应用规则行为及本应用已对您采取的措施。</p>
        <ol start="2">
          <li>信息使用</li>
        </ol>
        <p>(a)本应用不会向任何无关第三方提供、出售、出租、分享或交易您的个人信息，除非事先得到您的许可，或该第三方和本应用（含本应用关联公司）单独或共同为您提供服务，且在该服务结束后，其将被禁止访问包括其以前能够访问的所有这些资料。</p>
        <p>(b) 本应用亦不允许任何第三方以任何手段收集、编辑、出售或者无偿传播您的个人信息。任何本应用平台用户如从事上述活动，一经发现，本应用有权立即终止与该用户的服务协议。</p>
        <p>(c) 为服务用户的目的，本应用可能通过使用您的个人信息，向您提供您感兴趣的信息，包括但不限于向您发出产品和服务信息，或者与本应用合作伙伴共享信息以便他们向您发送有关其产品和服务的信息（后者需要您的事先同意）。</p>
        <ol start="3">
          <li>信息披露</li>
        </ol>
        <p>在如下情况下，本应用将依据您的个人意愿或法律的规定全部或部分的披露您的个人信息：</p>
        <p>(a) 经您事先同意，向第三方披露；</p>
        <p>(b)为提供您所要求的产品和服务，而必须和第三方分享您的个人信息；</p>
        <p>(c) 根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；</p>
        <p>(d) 如您出现违反中国有关法律、法规或者本应用服务协议或相关规则的情况，需要向第三方披露；</p>
        <p>(e) 如您是适格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷；</p>
        <p>(f) 在本应用平台上创建的某一交易中，如交易任何一方履行或部分履行了交易义务并提出信息披露请求的，本应用有权决定向该用户提供其交易对方的联络方式等必要信息，以促成交易的完成或纠纷的解决。</p>
        <p>(g) 其它本应用根据法律、法规或者网站政策认为合适的披露。</p>
        <ol start="4">
          <li>信息存储和交换</li>
        </ol>
        <p>本应用收集的有关您的信息和资料将保存在本应用及（或）其关联公司的服务器上，这些信息和资料可能传送至您所在国家、地区或本应用收集信息和资料所在地的境外并在境外被访问、存储和展示。</p>
        <ol start="5">
          <li>数据缓存的使用</li>
        </ol>
        <p>(a) 在您未拒绝接受缓存的情况下，本应用会在您的手机上设定或取用缓存 ，以便您能登录或使用依赖于缓存的本应用平台服务或功能。本应用使用缓存可为您提供更加周到的个性化服务，包括推广服务。</p>
        <p>(b) 通过本应用所设缓存所取得的有关信息，将适用本政策。</p>
        <ol start="6">
          <li>信息安全</li>
        </ol>
        <p>(a) 本应用帐号均有安全保护功能，请妥善保管您的用户名及验证码信息。本应用将通过对用户验证码进行加密等安全措施确保您的信息不丢失，不被滥用和变造。尽管有前述安全措施，但同时也请您注意在信息网络上不存在&ldquo;完善的安全措施&rdquo;。</p>
        <p>7.本隐私政策的更改</p>
        <p>(a)如果决定更改隐私政策，我们会在本政策中、本公司网站中以及我们认为适当的位置发布这些更改，以便您了解我们如何收集、使用您的个人信息，哪些人可以访问这些信息，以及在什么情况下我们会透露这些信息。</p>
        <p>(b)本公司保留随时修改本政策的权利，因此请经常查看。如对本政策作出重大更改，本公司会通过网站通知的形式告知。</p>
        <p>为防止向第三方披露自己的个人信息，如联络方式或者邮政地址。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息泄密，尤其是本应用用户名及密码发生泄露，请您立即联络本应用客服，以便本应用采取相应措施。</p>
        <p style="text-align: right;">本协议于2020年3月4日发布并执行。</p>
        <p>&nbsp;</p>
      </div>
    </van-popup>
    <van-popup
      v-model="setInShow"
      style="height:70%;width:80%;"
      round
    >
      <div style="padding: 15px 15px; margin:30px 0 0 0;">
        <p style="text-align: center;"><strong>注册协议</strong></p>
        <p>一、提示条款</p>
        <p>在接受本协议之前，应当认真阅读本协议。请用户务必审慎阅读、充分理解各条款内容，特别是免除或限制责任的条款、法律适用、和争议解决条款。免除或限制责任的条款将以粗体下划线标识，应重点阅读。</p>
        <ul>
          <li>定义</li>
        </ul>
        <p>泡泡心理：系指江苏曼珠沙华心理信息咨询有限公司运营的APP、网站、移动端、微信端。</p>
        <p>三、协议内容</p>
        <ul>
          <li>本协议内容包括协议正文以及所有泡泡心理已经发布的或将来可能发布的各类规则、通知、公告等。所有规则为协议不可分割的组成部分，与协议正文具有同等法律效力。泡泡心理将就网站制定特别规则（下称"特别规则"），如特别规则与网站其他规则存在冲突，则以特别规则为准。</li>
          <li>用户在使用泡泡心理提供的各项服务的同时，承诺接受并遵守各项相关规则的规定。泡泡心理有权根据需要不时地制定、修改本协议或各类规则，如有任何变更，泡泡心理将在网站、APP等以公示的方式进行公告，不再单独通知每个用户。变更后的协议和规则一经公布即自动生效，成为本协议的一部分。如用户不同意相关变更，应当立即以书面通知的方式终止本协议；任何修订和新规则一经在网站上公布即自动生效，成为本协议的一部分。如用户登陆或继续使用服务的，则视为对修改后的协议和规则不持异议并同意遵守。如用户不同意本协议任何一项条款或语句的，可以主动终止使用泡泡心理服务或产品。除另行明确声明外，任何使服务范围扩大或功能增强的新内容均受本协议约束。</li>
          <li>泡泡心理保留在任何时候自行决定对服务及其相关功能、应用软件变更、升级的权利。泡泡心理进一步保留在服务中开发新的模块、功能和软件或其它语种服务的权利。上述所有新的模块、功能、软件服务的提供，除非泡泡心理另有说明，否则仍适用本协议。服务随时可能因泡泡心理的单方判断而被增加或修改，或因定期、不定期的维护而暂缓提供，用户将会得到相应的变更通知。用户在此同意泡泡心理在任何情况下都无需向其或第三方在使用服务时对其在传输或联络中的迟延、不准确、错误或疏漏及因此而致使的损害负责。</li>
        </ul>
        <p>四、用户资格</p>
        <ul>
          <li>用户确认，在完成注册或以泡泡心理允许的方式实际享受泡泡心理提供的服务时，用户应当是具备完全民事权利能力和与所从事的民事行为相适应的自然人。</li>
          <li>如用户是一个未成年人，请在享受泡泡心理提供的服务前取得监护人同意。</li>
          <li>一经发现用户不具备前述主体资格使用泡泡心理服务或产品的，由此产生一切后果由用户及其监护人承担，且泡泡心理有权立即注销用户的账户。</li>
        </ul>
        <p>五、账户说明</p>
        <ul>
          <li>当用户按照本网站的流程完成全部注册程序后，用户可获得本网站账户的使用权并成为泡泡心理用户。用户用对自己的账户和验证码的安全负责。除非有法律规定或司法裁定，且征得泡泡心理的同意，否则，账户不得以任何方式转让、赠与或继承。如发现任何人不当使用用户的账户或有任何其他可能危及用户账户安全的情形时，用户应当立即以有效方式通知泡泡心理，要求泡泡心理暂停相关服务。</li>
          <li>泡泡心理只允许每位用户使用一个账户。如有证据证明或泡泡心理有理由相信用户存在不当注册或不当使用多个账户的情形，泡泡心理可注销账户并拒绝提供服务措施，如给泡泡心理及其相关方造成损失的，用户还应承担赔偿责任。</li>
          <li>为了使用户更好地使用泡泡心理提供的服务，保障用户的账户安全，泡泡心理可要求用户按要求及我国法律规定完成实名认证。</li>
        </ul>
        <p>六、账户说明</p>
        <ul>
          <li>合法性</li>
        </ul>
        <p>用户在使用泡泡心理服务及产品时，务必遵守中华人民共和国相关法律法规的规定，不得把泡泡心理提供的服务及产品用于任何违法或不正当或不道德的活动，否则泡泡心理可采取注销账户并拒绝提供服务措施包括但不限于以下行为：</p>
        <ul>
          <li>违反宪法或法律法规规定的；危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；损害国家荣誉和利益的，损害公共利益的；煽动民族仇恨、民族歧视，破坏民族团结的；破坏国家宗教政策，宣扬邪教和封建迷信的；散布谣言，扰乱社会秩序，破坏社会稳定的；散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；侮辱或者诽谤他人，侵害他人合法权益的；含有法律、行政法规禁止的其他内容的；</li>
          <li>以任何非法目的而使用网络服务系统；</li>
          <li>故意制作、传播计算机病毒等破坏性程序；</li>
          <li>其他危害计算机信息网络安全的行为。</li>
          <li>用户设置的网站会员名不得违反国家法律法规及本网站相关规则，否则泡泡心理有权终止用户的该会员名。会员名的终止不影响用户以邮箱、手机号码登录本网站并使用泡泡心理提供的服务。</li>
          <li>真实性</li>
        </ul>
        <p>用户注册应同意以下事项：提供真实、正确、最新及完整的资料，并随时更新登记资料，确保其为真实、正确、最新及完整的资料。若用户提供任何错误、不实、过时或不完整或具误导性的资料，或者泡泡心理有理由怀疑前述资料为错误、不实、过时或不完整或具误导性的，泡泡心理有权立即暂停或终止用户的帐号，并拒绝用户于现在和未来使用泡泡心理所提供服务之全部或任何部分。适用范围包括：</p>
        <ul>
          <li>在用户注册本网站账户时，用户根据泡泡心理要求提供的注册信息；</li>
          <li>在用户使用本网站服务，或访问本网站时，本网站自动接收并记录用户的浏览器和计算机上的信息，包括但不限于用户的IP地址、浏览器的类型、使用的语言、使用的语言、访问日期和时间、软硬件特征信息及用户需求的网页记录等数据；</li>
          <li>泡泡心理通过合法途径从商业伙伴处取得的用户数据。</li>
          <li>更新维护</li>
          <li>用户应当及时更新您提供的信息，泡泡心理将依法不时地对用户的信息进行检查核实，用户应当配合提供最新、真实、完整、有效的信息。</li>
          <li>如泡泡心理按用户最后一次提供的信息与用户联系未果、用户未按泡泡心理的要求及时提供信息、用户提供的信息存在明显不实或行政司法机关核实用户提供的信息无效的，用户将承担因此对您自身、他人及泡泡心理造成的全部损失与不利后果。泡泡心理可向用户发出询问或要求整改的通知，并要求用户进行重新认证，直至中止、终止对用户提供部分或全部服务，泡泡心理对此不承担责任。</li>
        </ul>
        <p>七、用户发布的信息</p>
        <ul>
          <li>用户声明并保证，用户对自己所发表的信息、评论等拥有相应、合法的权利。否则，泡泡心理有权即时对用户发布的信息进行删除、屏蔽处理。</li>
          <li>用户应当确保您所发布的信息不包含以下内容：</li>
          <li>违反国家法律法规禁止性规定的；</li>
          <li>政治宣传、封建迷信、淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；</li>
          <li>欺诈、虚假、不准确或存在误导性的；</li>
          <li>侵犯他人知识产权或涉及第三方商业秘密及其他专有权利的；</li>
          <li>侮辱、诽谤、恐吓、涉及他人隐私等侵害他人合法权益的；</li>
          <li>存在可能破坏、篡改、删除、影响本网站任何系统正常运行或未经授权秘密获取本网站及其他用户的数据、个人资料的病毒、木马、爬虫等恶意软件、程序代码的；</li>
          <li>其他违背社会公共利益或公共道德或依据本网站的规定不适合在网站上发布的。</li>
        </ul>
        <p>八、隐私保护</p>
        <ul>
          <li>请用户妥善保管您的账户及密码信息。若用户发现账户被他人非法使用，应立即通知泡泡心理。因不可抗力（包括黑客行为、计算机病毒、系统不稳定等）、遭受他人诈骗或用户主动泄露、保管疏忽导致账号、密码被他人非法使用的，泡泡心理不承担任何责任。</li>
          <li>泡泡心理将采取合理的安全手段保护用户已存储的个人信息，除下述信息披露条款外，在未得到用户许可之前，泡泡心理不会将用户的任何个人信息提供给任何无关的第三方（包括公司或个人）。</li>
          <li>经用户事先同意，向第三方披露；</li>
          <li>只有通过使用用户的保密信息，才能向用户提供所要求的产品服务；</li>
          <li>根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；</li>
          <li>如用户出现违反中国有关法律、法规或者本网站法律声明、服务协议或相关规则的情况，需要向第三方披露；</li>
          <li>维护本网站的合法权益；</li>
          <li>根据本协议相关规定或者本网站认为必要的其他情况。</li>
        </ul>
        <p>九、权利声明</p>
        <ul>
          <li>泡泡心理所属公司拥有本网站内的所有产品、技术、程序、资料、信息内容（包括但不限于文字、图片、图像、照片、音频、视频、图表、色彩、版面设计、电子文档）的所有权利（包括但不限于版权、商标权、专利权、商业秘密及其他所有相关权利）。未经权利人许可，任何人不得擅自使用。</li>
          <li>用户在接受本协议时即视为主动将其在本网站发表的任何形式的信息的著作权，包括但不限于复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及《著作权法》规定的由著作权人享有的其他著作财产权利无偿独家转让给泡泡心理所有，若发生第三人侵权，泡泡心理有权单独提起诉讼并获得全部赔偿。</li>
          <li>用户同意泡泡心理网站后服务市场的全部运营数据，包括但不限于用户信息、用户列表、用户关系、用户的使用数据、交易数据、订单数据等，其全部的权利均归属于泡泡心理。未经泡泡心理事先书面同意，均不得利用用户列表及用户关系、向用户发送信息，不得为任何目的擅自保存、备份、泄露、使用或授权他人使用前述运营数据。本协议自然终止或提前解除后，用户无权要求备份前述运营数据。</li>
          <li>用户通过注册所得的本网站账户（即本网站用户ID）所有权归属于本网站公司，用户仅对该账户拥有使用权。用户不能以任何方式转让其账户的使用权，如用户违反上述规定，泡泡心理有权追究的违约责任，由此产生的一切责任由其自行承担。</li>
          <li>对不遵守本协议或其他违法、未经许可或者恶意使用本网站内容者，本网站所属公司保留追究其法律责任的权利。</li>
        </ul>
        <p>十、第三方主张权利</p>
        <p>若用户认为本网站的内容，或通过本网站得到的内容可能涉及侵犯其合法权益，应该及时以书面形式向泡泡心理反馈，并提供身份证明、权属证明、具体链接（URL）及详细侵权情况证明，泡泡心理在收到上述法律文件并经审查同意后，将会在合理时间内依法尽快移除、删除相关涉嫌侵权的内容或断开网络连接。如权利通知的陈述失实，权利通知提交者将承担由此造成的全部法律责任。</p>
        <p>十一、不保证链接可用性</p>
        <p>用户承认并同意，泡泡心理并不对网站上其他链接的可用性负责，且不认可链接上任何内容、宣传、产品、服务或其他材料，也不对其负责或承担任何责任。用户进一步承认和同意，对于任何因使用或信赖本网站上获取的此宣传、产品、服务或其他材料而造成（或声称造成）的任何直接或间接损失，泡泡心理均不承担责任。&nbsp;</p>
        <p>十二、反贿赂</p>
        <ul>
          <li>泡泡心理坚持认真贯彻国家关于反商业贿赂的各项规定，努力建立健全反对不正当交易行为和反商业贿赂的长效机制。</li>
          <li>泡泡心理坚持严厉打击商业贿赂行为，对违反本声明相关规定的员工，将严肃查处和教育，情节严重的，及时报告相关机构；对违反本声明相关规定的用户或合作伙伴，一经查实，泡泡心理有权终止对用户提供服务，并保留追究相关法律责任的权利。</li>
          <li>泡泡心理愿意在公开透明、公正平等、诚实信用的合作机制下，与所有用户及合作伙伴们&ldquo;共赢&rdquo;美好明天。真诚希望用户及合作伙伴们能理解并支持本泡泡心理的反商业贿赂政策，并欢迎对泡泡心理及员工遵守本声明政策的情况进行监督。</li>
        </ul>
        <p>十三、保密</p>
        <ul>
          <li>用户保证在使用本网站过程中所获悉的属于本网站及他方的且无法自公开渠道获得的商业秘密、专有信息、双方共有的客户信息及其他保密性质的所有信息均为保密信息（包括但不限于商业秘密、公司计划、运营活动、财务信息、技术信息、经营信息及其他商业秘密）。未经该信息的原享有方同意，不应以任何形式向第三方披露或泄露保密信息，否则，应承担赔偿损失责任。</li>
          <li>不论本服务协议是否变更、解除或终止，本条款均由法律效力。</li>
        </ul>
        <p>十四、免责条款</p>
        <ul>
          <li>避风港原则</li>
          <li>泡泡心理对于用户的文章、图片等内容提供空间存储服务，不参与制作用户文章、图片等内容，对用户亦无担保、推荐义务，亦不从中直接获取经济利益。</li>
          <li>若版权人或版权代理人认为用户发表的文章、图片等内容侵犯自身知识产权的，应通知泡泡心理，泡泡心理将及时删除断开侵权作品，并不承担赔偿责任。</li>
          <li>心理咨询</li>
          <li>用户理解并同意：若有心理疾病，应寻求专业的心理咨询师予以治疗；而且，心理咨询的效果取决于咨询师与用户双方配合作用的结果。泡泡心理向用户提供的问答功能、向咨询师发私信功能并不能达到治疗效果，亦不能达到专业的心理咨询服务效果。</li>
          <li>泡泡心理不保证用户发布的问题一定有咨询师回答，亦不保证咨询师的回答一定能帮助用户解决问题，亦不保证咨询师的回答一定能达到怎样的效果。</li>
          <li>用户理解并同意：达不到来访者心理预期的心理咨询效果，不属于服务质量问题，泡泡心理作为平台对此不承担任何担保责任或其他法律责任。</li>
          <li>用户因在使用泡泡心理平台功能中（包括：发布问答、给咨询师私信等）自身原因而突发疾病或意外死亡，或因自身原因造成情绪失控而发生自伤、自残、自杀等后果，泡泡心理尽可能采取措施控制事态恶化，必要时与相关部门取得联系。由此造成的损害后果，泡泡心理不承担责任。</li>
          <li>有自杀倾向或自杀未遂行为的用户应寻求咨询师专业的心理咨询服务。用户同意并理解：在泡泡心理发布问答或给咨询师发私信，并不能达到心理治疗效果。如用户最终选择自杀，责任及后果将由用户本人全部承担，与泡泡心理及咨询师无关。</li>
          <li>本协议不适用咨询师与用户私下交易。私下交易包括但不限于：咨询师与用户通过平台互相认识/曾经发生过交易，但是，双方之后约定不通过泡泡心理平台支付/收取咨询费，由咨询师直接收取用户咨询费/咨询师指定其它第三方机构收取用户咨询费而产生的咨询服务交易。</li>
          <li>唯一只有通过泡泡心理平台收取咨询费的咨询服务，泡泡心理平台才会协助解决咨询师与用户之间产生的咨询费纠纷。除此之外，泡泡心理不承担任何责任，特别是私下交易。</li>
          <li>心理测评</li>
        </ul>
        <p>泡泡心理的心理测评由系统自动完成，测评结果和个人分析报告仅供被测评人单方参考，泡泡心理对测评结果不负任何保证义务，不承担任何形式的法律责任，包括但不限于心理疾病的治疗、心理危机的解除等。非测评系统自身问题，泡泡心理有权拒绝参与解决。</p>
        <ul>
          <li>泡泡心理不保证网络服务的及时性、安全性、准确性。不论在何种情况下，均不对由于Internet连接故障，电脑，通讯或其他系统的故障，电力故障，罢工，劳动争议，暴乱，起义，骚乱，生产力或生产资料不足，火灾，洪水，风暴，爆炸，不可抗力，战争，政府行为，国际、国内法院的命令或第三方的不作为而造成的不能服务或延迟服务承担责任。请用户务必及时保存自己的需求，否则因网络服务中断，需要维修、检修、维护等导致损失的，泡泡心理不承担损失赔偿的责任。</li>
          <li>在任何情况下，对于因使用泡泡心理网站内容或无法进入本网站而导致的任何直接的、间接的、附带的、给第三人造成的损失（包括但不限于利润损失、信息数据丢失、财产毁坏等损失）泡泡心理均无须承担法律责任，不论是采用合同之诉、侵权之诉或其他诉讼理由。</li>
          <li>未经授权的存取或修改数或数据的传输，泡泡心理不承担赔偿因此造成损失的责任。</li>
          <li>第三方通过服务所作的陈述或行为，泡泡心理不承担赔偿因此造成损失的责任。</li>
          <li>其他与服务相关事件，包括疏忽等所造成的损害，泡泡心理不承担赔偿因此造成损失的责任。</li>
        </ul>
        <p>十五、协议终止</p>
        <ul>
          <li>终止的情形</li>
          <li>【用户发起的终止】用户有权通过以下任一方式终止本协议：</li>
          <li>变更事项生效前用户停止使用并明示不愿接受变更事项的；</li>
          <li>用户明示不愿继续使用泡泡心理提供的服务，且符合本网站终止条件的。</li>
          <li>【泡泡心理发起的终止】出现以下情况时，泡泡心理有权无须通知用户即终止本协议：</li>
          <li>违反本协议约定，泡泡心理依据违约条款终止本协议的；</li>
          <li>盗用他人账户、发布违禁信息、骗取他人财物、扰乱网站秩序、采取不正当手段谋利等行为，泡泡心理对用户的账户予以查封的；</li>
          <li>除上述情形外，若用户多次违反泡泡心理相关规定且情节严重，泡泡心理有权对其的账户予以查封的：</li>
          <li>用户的账户被泡泡心理依据本协议取消的；</li>
          <li>有欺诈、发布或侵犯他人合法权益或其他严重违法违约行为的；</li>
          <li>其它应当终止服务或泡泡心理拒绝提供服务的情况。</li>
          <li>协议终止后的处理</li>
          <li>【用户信息披露】本协议终止后，除法律有明确规定外，泡泡心理无义务向用户或用户指定的第三方披露用户账户中的任何信息。</li>
          <li>【本网站权利】本协议终止后，泡泡心理仍享有下列权利：</li>
          <li>继续保存用户留存于本网站的本协议的各类信息；</li>
          <li>对于用户过往的违约行为，本网站仍可依据本协议追究其违约责任。</li>
        </ul>
        <p>十六、违约责任</p>
        <ul>
          <li>除本协议另有约定之外，如一方发生违约行为，守约方可以书面通知方式要求违约方在指定的时限内停止违约行为，并就违约行为造成的损失（包括但不限于诉讼费、仲裁费、差旅费等）进行索赔，如违约方未能按时停止违约行为，则守约方有权立即终止本协议。</li>
          <li>泡泡心理因违约或侵权依法对用户赔偿损失的，赔偿额以实际最终收取用户款项总额为限。</li>
        </ul>
        <p>十七、有效通知</p>
        <ul>
          <li>用户应当准确填写并及时更新提供给泡泡心理的电子邮件地址、联系电话、联系地址、邮政编码等联系方式，保证联系方式的有效性及安全性，以便泡泡心理及咨询师可以通过上述联系方式与自己进行有效联系。如因通过上述联系方式无法与用户取得联系，导致泡泡心理站产生任何损失或增加费用的，应由用户完全独立承担。</li>
          <li>本协议下所规定的通知有权要求以书面形式通过以下邮址递交收悉，通知的到达以泡泡心理收悉为准。</li>
        </ul>
        <p>十八、争议及其他</p>
        <ul>
          <li>本协议之解释与适用，以及与本协议有关的争议，均应依照中华人民共和国法律予以处理，并以苏州工业园区人民法院为管辖法院。</li>
          <li>如本协议的任何条款被视作无效或无法执行，则上述条款可被分离，其余部分则仍具有法律效力。</li>
        </ul>
        <p style="text-align: right;">本协议于2020年3月4日发布并执行。</p>
        <p>&nbsp;</p>
      </div>
    </van-popup>
    <van-button class="footer" :loading="loading" loading-text="登入中..." @click="login">注册</van-button>
  </div>
</template>>

<script>
import { register, registerGetCode } from '@/api/consultant'
import { setToken } from '@/utils/token'
export default {
  name: 'LoginPage',
  data() {
    return {
      popBox: false,
      phone: '',
      check: true,
      code: '',
      codeLoading: false,
      loading: false,
      verifyTime: '',
      verifyShow: false,
      show: false,
      setInShow: false
    }
  },
  methods: {
    checkPhone() {
      var phone = this.phone
      if (!/^1[3456789]\d{9}$/.test(phone)) {
        this.$notify('请输入正确的手机号')
        this.phone = ''
        return false
      }
      return true
    },
    closeBox() {
      this.popBox = false
    },
    login() {
      if (this.code === '' || this.code.length !== 4) {
        this.$notify('请输入4位验证码')
        return
      }
      if (this.checkPhone()) {
        this.loading = true
        this.spreadUrl = this.$route.params && this.$route.params.id
        register(this.phone, this.code, this.spreadUrl).then(r => {
          this.loading = false
          if (!r.success) {
            this.$notify(r.message)
          } else {
            setToken(r.result.token)
            localStorage.setItem('USER_ID', r.result.userId)
            localStorage.setItem('CONSULTANT_ID', r.result.consultantId)
            localStorage.setItem('CONSULTANT_STATUS', r.result.consultantStatus)
            localStorage.setItem('CONSULTANT_REMARK', r.result.consultantRemark)
            if (r.result.consultantStatus === 0) {
              localStorage.setItem('STEP', 1)
            } else {
              localStorage.setItem('STEP', 5)
            }
            //this.$router.push({ name: 'consulant' })
            window.location.href = 'http://download.psyooo.com/bcx5'
          }
          console.log(r)
        })
      }
    },
    getCode() {
      if (this.checkPhone()) {
        this.codeLoading = true
        const _this = this
        console.log(this.phone)
        registerGetCode(this.phone).then(r => {
          this.codeLoading = false
          if (r.success) {
            this.$dialog.alert({
              message: '验证码获取成功'
            })
            this.verifyTime = 60
            _this.verifyShow = true
            _this.timeInterval = setInterval(() => {
              if (_this.verifyTime > 0) {
                _this.verifyTime--
              } else {
                _this.verifyShow = false
                window.clearInterval(_this.timeInterval)
              }
            }, 1000)
          } else {
            this.$dialog.alert({
              message: r.message
            })
          }
          // 跳转一下一个界面
        })
        return
      }
    },
    showPopup() {
      this.show = true
    },
    setInShowPopup() {
      this.setInShow = true
    }
  }
}
</script>>

<style scoped>
p {
   font-size: 14px;
}

li {
   font-size: 14px;
}
.loginPage {
  width: 100%;
  height: 100%;
  background-image: url('../assets/images/background.png');
  background-size: 100% 100%;
}

.trademark {
  margin: 0 auto;
  width: 2rem;
  height: 3rem;
  padding-top: 3rem;
  padding-bottom: 1rem;
  text-align: center;
  font-size: 0.32rem;
  font-weight: 600;
  color: #80cf94;
  line-height: 0.8rem;
}

.logonImg {
  width: 2rem;
  height: 2rem;
  /* border: .02rem solid #9ddcb0; */
  box-shadow: 0rem 0rem 0.27rem #9ddcb0;
  border-radius: 0.4rem;
}

.phoneBox {
  width: 90%;
  margin: 0 auto;
  border: 0.02rem solid #f0f0f0;
  box-shadow: 0rem 0rem 0.27rem #9ddcb0;
  border-radius: 0.1rem;
  display: flex;
  flex-direction: row;
  align-items: center;
  margin-bottom: 0.3rem;
}

.phoneImg {
  width: 0.3rem;
  height: 0.46rem;
  margin: 0 0.2rem;
}

.smsBox {
  width: 90%;
  margin: 0 auto;
  display: flex;
  justify-content: space-between;
  align-items: center;
  margin-bottom: 3rem;
}

.codeBox {
  width: 60%;
  border: 0.02rem solid #9ddcb0;
  box-shadow: 0rem 0rem 0.27rem #9ddcb0;
  border-radius: 0.1rem;
  display: flex;
  flex-direction: row;
  align-items: center;
}

.van-button {
  background: #9ddcb0;
  border: 0.02rem solid #9ddcb0;
  color: #ffffff;
}
.checkbox {
  display: flex;
  justify-content: center;
  margin-bottom: 0.2rem;
}

input[type='checkbox'] + label::before {
  content: '\a0';
  /*不换行空格*/
  display: inline-block;
  width: 0.26rem;
  height: 0.26rem;
  border: 0.02rem solid rgba(157, 220, 177);
  border-radius: 0.05rem;
  background-color: #ffffff;
  line-height: 0.26rem;
  margin-right: 0.08rem;
  /*行高不加单位，子元素将继承数字乘以自身字体尺寸而非父元素行高*/
}

input[type='checkbox']:checked + label::before {
  content: '\2713';
  background-color: #ffffff;
  text-align: center;
  color: #80cf94;
  font-size: 0.22rem;
}

.checkbox input {
  position: absolute;
  clip: rect(0, 0, 0, 0);
}

input[type='checkbox']:disabled + label::before {
  background-color: #ffffff;
  box-shadow: none;
  color: #555;
}
.footer {
  text-align: center;
  color: #ffffff;
  width: 6.9rem;
  height: 0.8rem;
  line-height: 0.8rem;
  font-size: 0.26rem;
  margin: 0.3rem;
  background-color: #9ddcb0;
  border-radius: 0.14rem;
  margin-bottom: 0.4rem;
}
</style>
